{"   ": 50285, "                 ": 50271, "                            ": 50260, "                           ": 50261, "                ": 50272, "\t\t\t\t": 50292, "\t\t\t\t\t\t\t": 50289, "               ": 50273, "    ": 50284, "     ": 50283, "                         ": 50263, "                              ": 50258, "                   ": 50269, "                               ": 50257, "                       ": 50265, "             ": 50275, "                     ": 50267, "                  ": 50270, "          ": 50278, "  ": 50286, "            ": 50276, "                             ": 50259, "\t\t\t\t\t\t": 50290, "                    ": 50268, "         ": 50279, "\t\t\t\t\t\t\t\t\t": 50287, "\t\t\t": 50293, "                        ": 50264, "                      ": 50266, "           ": 50277, "\t\t\t\t\t": 50291, "\t\t": 50294, "       ": 50281, "              ": 50274, "\t\t\t\t\t\t\t\t": 50288, "      ": 50282, "                          ": 50262, "        ": 50280}